LES_Data/OFInterpolateFiles/0/Tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
14751
((-1.7513217753475883e-03 -1.0407935880148118e-04 -1.1251328497227502e-05 -1.6797697479885929e-05 -3.1558716223825635e-07 -3.3698073217815379e-04)
(5.7299033505842079e-04 5.4520860430784523e-06 2.9630331255248160e-07 5.2613006573665178e-07 1.1584930348362832e-08 2.0959094399586320e-04)
(5.9077533660456538e-04 5.9624758250720342e-06 -4.1310677545425278e-08 5.8850196182902437e-07 1.6357612153683476e-08 2.1886732429265979e-04)
(6.1245670076459635e-04 6.5735757743823342e-06 -5.3946661182635580e-07 6.6607196913537337e-07 2.4658589836690219e-08 2.2956554312258959e-04)
(6.4041744917631138e-04 7.3408459684287664e-06 -9.3290685754254799e-07 7.7153083566372516e-07 3.2512417647012619e-08 2.4216788006015119e-04)
(6.7369802854955196e-04 8.2326077972538752e-06 -1.0848856391021400e-06 9.0582625489332724e-07 3.7698612231906743e-08 2.5650407769717282e-04)
(7.1192579343914975e-04 9.2509326350409538e-06 -9.8499640444060788e-07 1.0707053661462851e-06 4.3859991194494803e-08 2.7221610071137542e-04)
(7.5377145549282442e-04 1.0386476787971333e-05 -6.3897243762767175e-07 1.2651777296923683e-06 5.2833385666417598e-08 2.8902286430820817e-04)
(7.9966417979449045e-04 1.1701953553711064e-05 -1.4545373971941444e-07 1.5060952591738896e-06 5.9371927818574477e-08 3.0716619221493602e-04)
...
(-6.1495602298315515e-04 1.3117719782874669e-04 -1.5842081894352995e-06 -8.8513171128643114e-05 8.6453459284467264e-08 4.4806094317485518e-04))
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            zeroGradient;
    }
}