LES_Data/OFInterpolateFiles/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
14751
((6.1375348109687977e-02 -3.6485996411151532e-06 2.1460345778561893e-04)
(6.6747657954692841e-02 -7.7712147685815580e-06 3.2508792355656618e-04)
(6.8672746419906616e-02 -7.3883584263967359e-06 3.3434000215493143e-04)
(7.0749983191490173e-02 8.9622035375214182e-06 3.5966647556051617e-04)
(7.3107138276100159e-02 8.3741952039417821e-07 3.7281442200765019e-04)
(7.5648263096809373e-02 1.9190424609405454e-06 3.9905565790832043e-04)
(7.8222498297691345e-02 7.3882242759282244e-06 4.2318782652728260e-04)
(8.0776840448379517e-02 -5.4923607422097120e-06 4.1466485708951961e-04)
(8.3222359418869019e-02 7.9686287790536880e-06 5.0516333431005478e-04)
...
(-1.0737401908099020e-02 1.0191270680470343e-04 -4.5521789526994611e-05))
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}