LES_Data/OFInterpolateFiles/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
14751
(4.7543088330271772e+01
2.3782600402832038e+01
2.3788833618164059e+01
2.3795345306396481e+01
2.3802198410034180e+01
2.3809286117553722e+01
2.3816509246826179e+01
2.3823860168457038e+01
2.3831310272216800e+01
...
4.6900772474393960e+01)
;
boundaryField
{
    bottomWall 
    { 
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            symmetry;
    }
}
